字典：当索引不好用时
映射
>>> brand = ['李宁','耐克','阿迪达斯','鱼c工作室']
>>> slogan = ['一切皆有可能','Just do it','Impossible is nothing','让编程改变世界']
>>> print('鱼c工作室的口号是:',slogan[brand.index('鱼c工作室')])
鱼c工作室的口号是: 让编程改变世界
创建和访问字典
中括号表示列表
小括号表示元组
大括号表示质点，质点是映射类型
>>> dict = {'李宁':'一切皆有可能','耐克':'Just do it','阿迪达斯':'Impossible is nothing','鱼c工作室':'让编程改变世界'}
>>> print('鱼c工作室的口号是:',dict['鱼c工作室'])#键key作为索引
鱼c工作室的口号是: 让编程改变世界

>>> dict2 = {1:'one',2:'two',3:'three'}
>>> dict2
{1: 'one', 2: 'two', 3: 'three'}
>>> dict2[2]
'two'
>>> dict3 = {}
>>> dict3
{}

>>> dict3 = dict((('F',70),('i',105),('s',115),('h',104),('C',67)))
>>> dict3
{'F': 70, 'i': 105, 's': 115, 'h': 104, 'C': 67}


>>> dict4 = dict(小甲鱼='让编程改变世界',李宁='一切皆有可能')
>>> dict4
{'小甲鱼': '让编程改变世界', '李宁': '一切皆有可能'}
>>> dict4['李宁'] ='Impossible is nothing,一切皆有可能'
>>> dict4
{'小甲鱼': '让编程改变世界', '李宁': 'Impossible is nothing,一切皆有可能'}
>>> dict4['爱迪生'] = '天才就是99%的汗水+1%的灵感，但这1%的灵感远远比99%的汗水更重要'
>>> dict4
{'小甲鱼': '让编程改变世界', '李宁': 'Impossible is nothing,一切皆有可能', '爱迪生': '天才就是99%的汗水+1%的灵感，但这1%的灵感远远比99%的汗水更重要'}

