列表，元组和字符串的共同点
-都可以通过索引得到每一个元素
-默认索引值总是从0开始
-可以通过分片的方法得到一个范围内的元素的集合
-有很多共同的操作符（重复操作符**，拼接操作符+，成员关系操作符in  not in ）
序列
list()把一个可迭代对象转换为列表
tuple([iterable])把一个可迭代对象转换为元组#迭代就是一个for循环
>>> a = list()
>>> a
[]
>>> b = 'I love fishC.com'
>>> b = list(b)
>>> b
['I', ' ', 'l', 'o', 'v', 'e', ' ', 'f', 'i', 's', 'h', 'C', '.', 'c', 'o', 'm']
>>> c = (1,1,2,3,5,8,13,21,34)
>>> c = list(c)
>>> c
[1, 1, 2, 3, 5, 8, 13, 21, 34]
str(obj)把obj对象转换为字符串
len(sub)#返回参数sub的长度
max()返回序列或者参数集合中的最大值
>>> max(1,2,3,4,5)
5
>>> max(b)
'v'#v的ASCLL码值最大，所以返回
小写字母ASCLL码大于大写字母的ASCLL
min()返回序列或者参数集合中的最小值
>>> chars = '1234567890'
>>> min(chars)
'0'
min()或 max()要保证序列或者参数的类型统一
sum(iterable[,start=0])返回序列iterable和可选参数start的总和
sorted()返回一个排序的列表，从小到大#=list.sort()
sorted 把数组按顺序排的结果输出，但原数组无变化
sort()是将数组排列，改变了原数组，不输出结果
reversed()返回一个别带器对象
list(reversed(名称))#倒置排列
enumerate()
>>> numbers
[1, 18, 13, 0, -98, 34, 54, 76, 32]
>>> enumerate(numbers)
<enumerate object at 0x000001A4EAB80540>
>>> list(enumerate(numbers))
[(0, 1), (1, 18), (2, 13), (3, 0), (4, -98), (5, 34), (6, 54), (7, 76), (8, 32)]
#把索引值变成元组插入
zip返回由各个参数的序列组成的元组
>>> a = [1,2,3,4,5,6,7,8]
>>> b = [4,5,6,7,8]
>>> zip(a,b)
<zip object at 0x000001A4EAB11C80>
>>> list(zip(a,b))
[(1, 4), (2, 5), (3, 6), (4, 7), (5, 8)]#成对打包


